app/controllers/accounts_controller.rb

    def create
        @account = Account.new(account_params)
        if @account.valid?
            @account.save
---
INSERT INTO "accounts" ("name", "password_digest", "balance", "broker_acc", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)