app/controllers/application_controller.rb

    def current_account
        Account.find_by(id: session[:acc_id]) || nil
---
SELECT  "accounts".* FROM "accounts" WHERE "accounts"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]