app/controllers/holdings_controller.rb

SELECT  "stocks".* FROM "stocks" WHERE "stocks"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "holdings" ("account_id", "stock_id", "balance", "price", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["account_id", 2], ["stock_id", 1], ["balance", 5], ["price", 200], ["created_at", "2019-08-12 16:17:32.394007"], ["updated_at", "2019-08-12 16:17:32.394007"]]
UPDATE "accounts" SET "balance" = ?, "updated_at" = ? WHERE "accounts"."id" = ?  [["balance", 0], ["updated_at", "2019-08-12 16:40:35.734356"], ["id", 4]]
UPDATE "accounts" SET "balance" = ?, "updated_at" = ? WHERE "accounts"."id" = ?  [["balance", 950], ["updated_at", "2019-08-13 03:51:07.259561"], ["id", 6]]
INSERT INTO "holdings" ("account_id", "stock_id", "balance", "price", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["account_id", 4], ["stock_id", 1], ["balance", 5], ["price", 200], ["created_at", "2019-08-12 16:40:35.741465"], ["updated_at", "2019-08-12 16:40:35.741465"]]
---
    def create
        #raise params.inspect
        if logged_in? && params[:holding][:stock_id]
            @stock = Stock.find_by(id: params[:holding][:stock_id])
            cost = params[:holding][:balance].to_i * @stock.price
            if current_account.balance < cost
                flash[:alert] = "Sorry. You don't have enough balance"
                redirect_to stocks_path
            else
                if !params[:holding][:balance].empty?
                    total = current_account.balance - cost
                    @holding = Holding.create(holding_params)
                    @holding.account = current_account
                    @holding.stock = @stock
                    current_account.update(balance: total)
                    @holding.price = @stock.price
                    @holding.save

SELECT  "stocks".* FROM "stocks" WHERE "stocks"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "accounts".* FROM "accounts" WHERE "accounts"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
SELECT "holdings".* FROM "holdings" WHERE "holdings"."stock_id" = ?  [["stock_id", 1]]
---
    def index
        if logged_in?
            @stock = Stock.find_by(id: params[:stock_id])
            @holdings = @stock.holdings.select { |f| f.account_id == current_account.id }

SELECT  "stocks".* FROM "stocks" WHERE "stocks"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "holdings".* FROM "holdings" WHERE "holdings"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]
---
    def show
        if logged_in?
            @stock = Stock.find_by(id: params[:stock_id])
            @holding = Holding.find_by(id: params[:id])

SELECT  "holdings".* FROM "holdings" WHERE "holdings"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]
SELECT  "stocks".* FROM "stocks" WHERE "stocks"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "holdings" SET "balance" = ?, "updated_at" = ? WHERE "holdings"."id" = ?  [["balance", 0], ["updated_at", "2019-08-13 16:18:07.474319"], ["id", 8]]
UPDATE "accounts" SET "balance" = ?, "updated_at" = ? WHERE "accounts"."id" = ?  [["balance", 5000], ["updated_at", "2019-08-13 16:36:35.377508"], ["id", 8]]
---
    def update
        @stock = Stock.find_by(id: params[:holding][:stock_id])
        @holding = Holding.find_by(id: params[:id])
        if !params[:unit].empty? && params[:unit].to_i > 0
            if params[:unit].to_i > @holding.balance
                flash[:alert] = "Sorry. You don't have enough balance"
                redirect_to stock_holding_path(@stock, @holding)
            else
                @holding.balance = @holding.balance - params[:unit].to_i
                @holding.save
                new_balance = params[:unit].to_i * @stock.price + current_account.balance
                current_account.update(balance: new_balance)