app/controllers/sessions_controller.rb

  def create
    @account = Account.find_by(name: params[:account][:name])
---
SELECT  "accounts".* FROM "accounts" WHERE "accounts"."name" = ? LIMIT ?  [["name", "test5"], ["LIMIT", 1]]

  def fbcreate
    binding.pry
    @account = Account.find_or_create_by(uid: auth['uid']) do |u|
---
INSERT INTO "accounts" ("name", "password_digest", "created_at", "updated_at", "uid", "provider") VALUES (?, ?, ?, ?, ?, ?)
SELECT  "accounts".* FROM "accounts" WHERE "accounts"."uid" = ? LIMIT ?  [["uid", "10220418271427236"], ["LIMIT", 1]]