app/controllers/stocks_controller.rb

    def create
        @stock = Stock.find_or_create_by(name: params[:stock][:name])
        @stock.update(stock_params)
---
INSERT INTO "stocks" ("name", "price", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Google"], ["price", 10], ["created_at", "2019-08-11 21:08:42.896343"], ["updated_at", "2019-08-11 21:08:42.896343"]]
SELECT  "stocks".* FROM "stocks" WHERE "stocks"."name" = ? LIMIT ?  [["name", "Lyft"], ["LIMIT", 1]]
UPDATE "stocks" SET "price" = ?, "updated_at" = ? WHERE "stocks"."id" = ?  [["price", 1000], ["updated_at", "2019-08-13 16:34:30.737877"], ["id", 2]]

    def show
        @stock = Stock.find_by(id: params[:id])
---
SELECT  "stocks".* FROM "stocks" WHERE "stocks"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

    def edit
        if logged_in? && current_account.broker_acc
            @stock = Stock.find_by(id: params[:id])
---
SELECT  "stocks".* FROM "stocks" WHERE "stocks"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]

    def update
        @stock = Stock.find_by(id: params[:id])
        @stock.update(stock_params)
---
SELECT  "stocks".* FROM "stocks" WHERE "stocks"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "stocks" SET "price" = ?, "updated_at" = ? WHERE "stocks"."id" = ?  [["price", 10], ["updated_at", "2019-08-12 15:51:55.618460"], ["id", 3]]