app/models/account.rb

SELECT  "accounts".* FROM "accounts" WHERE "accounts"."provider" = ? AND "accounts"."uid" = ? ORDER BY "accounts"."id" ASC LIMIT ?  [["provider", "facebook"], ["uid", "10220418271427236"], ["LIMIT", 1]]
INSERT INTO "accounts" ("name", "password_digest", "created_at", "updated_at", "uid", "provider") VALUES (?, ?, ?, ?, ?, ?)
UPDATE "accounts" SET "password_digest" = ?, "updated_at" = ? WHERE "accounts"."id" = ?  [["password_digest", "$2a$12$MTAHczs5d5LfxPnvvmuA3OQaoQvpAcPA7XzxoAravdoZAeoAwECVW"], ["updated_at", "2019-08-13 22:17:48.311216"], ["id", 9]]
---
    def self.from_omniauth(auth)
        where(provider: auth.provider, uid: auth.uid).first_or_initialize.tap do |acc|
            acc.provider = auth.provider
            acc.uid = auth.uid
            acc.name = auth.info.name unless acc.name != nil
            acc.password = SecureRandom.urlsafe_base64 unless acc.password != nil
            acc.save!