app/models/holding.rb

SELECT  "holdings".* FROM "holdings" ORDER BY "holdings"."balance" DESC LIMIT ?  [["LIMIT", 1]]
---
    scope :most, -> { order(balance: :DESC).limit(1).first }