app/views/accounts/show.html.erb

SELECT "holdings".* FROM "holdings" WHERE "holdings"."account_id" = ?  [["account_id", 4]]
---
    </tr>
<% @account.holdings.each do |s| %>